bu08cn = c( "sid", "loam", "行銷管理", "管理會計", "財務管理", "會計學", "經濟學一", 
"經濟學二", "網際網路應用", "電子企業經營管理", "資訊管理應用", "生產與作業管理", 
"人力資源管理", "商事法", "企業策略管理", "企業概論", "微積分一", "統計學一", 
"微積分二", "統計學二", "企業研究方法", "管理數學","計算機概論", 
"管理學", "電子商務概論", "企業倫理")

bu09cn = c("sid", "loam", "行銷管理", "管理會計", "財務管理", "會計學",
"經濟學一", "經濟學二", "網際網路應用", "電子商務概論", "電子企業經營管理",
"資訊管理應用", "管理學", "生產與作業管理", "人力資源管理", "企業策略管理",
"管理文獻探討", "統計學一", "統計學二", "企業研究方法", "管理數學",
"微積分", "專案管理", "創新與創業")

bu10cn = c("sid", "loam", "行銷管理", "管理會計", "財務管理", "會計學",
"應用經濟學", "網際網路應用", "電子商務概論", "電子企業經營管理",
"資訊管理應用", "管理學", "生產與作業管理", "人力資源管理", "企業策略管理",
"管理文獻探討", "企業研究方法", "專案管理", "創新與創業", "微積分一", "微積分二",
"統計學一", "統計學二", "經濟學")

bu11cn = c("sid", "loam", "行銷管理", "財務管理", "會計學", "企業電子化管理",
"商用軟體應用", "多媒體網站管理", "管理學", "生產與作業管理", "人力資源管理",
"企業策略管理", "管理文獻探討", "進階專案管理實務", "企業研究方法",
"統計學一", "統計學二", "創新與創業", "職涯分析與規劃", "微積分一", "微積分二", "經濟學")

bu12cn = c("sid", "loam", "行銷管理", "財務管理", "會計學", "企業電子化管理",
"商用軟體應用", "多媒體網站管理", "管理學", "生產與作業管理", "人力資源管理",
"企業策略管理", "進階專案管理實務", "企業研究方法", "統計學一", "統計學二",
"創新與創業", "職涯分析與規劃", "微積分一", "微積分二", "經濟學")

bu13cn = c("sid", "loam", "行銷管理", "財務管理", "會計學", "企業電子化管理",
"商用軟體應用", "多媒體網站管理", "管理學", "生產與作業管理", "人力資源管理",
"企業研究方法", "統計學一", "統計學二", "創新與創業", "微積分一", "微積分二",
"經濟學", "專案管理實務", "專案企劃實務")

bu14cn = c("sid", "loam", "行銷管理", "會計學", "企業電子化管理", "商用軟體應用",
"多媒體網站管理", "管理學", "生產與作業管理", "統計學一", "統計學二", "微積分一",
"微積分二", "經濟學", "專案管理實務")

bu15cn = c("sid", "loam", "商用軟體應用", "統計學一", "經濟學", "興趣與職涯探索")

ib08cn = c("sid", "loam", "計算機概論", "管理學", "電子商務概論", "企業倫理",
"國際商務英文一", "國際商務英文二", "商務英語溝通", "經濟學一", "經濟學二", "個體經濟學",
"總體經濟學", "微積分一", "微積分二", "統計學一", "統計學二", "電子商務應用",
"行銷管理", "全球行銷管理", "國際企業管理", "民法概要", "國際貿易實務", "商務資訊管理", 
"國際貿易理論", "會計學一", "會計學二", "財務管理", "國際金融理論")

ib09cn = c("sid", "loam", "行銷管理", "管理會計", "財務管理", "會計學",
"經濟學一", "經濟學二", "網際網路應用", "電子商務概論", "電子企業經營管理",
"資訊管理應用", "管理學", "生產與作業管理", "人力資源管理", "企業策略管理", 
"管理文獻探討", "統計學一", "統計學二", "企業研究方法", "管理數學",
"微積分", "專案管理", "創新與創業")

ib10cn = c("sid", "loam", "行銷管理", "管理會計", "財務管理", "會計學",
"應用經濟學", "網際網路應用", "電子商務概論", "電子企業經營管理",
"資訊管理應用", "管理學", "生產與作業管理", "人力資源管理", "企業策略管理",
"管理文獻探討", "企業研究方法", "專案管理", "創新與創業", "微積分一", "微積分二",
"統計學一", "統計學二", "經濟學")

ib11cn = c("sid", "loam", "行銷管理", "財務管理", "會計學", "企業電子化管理",
"商用軟體應用", "多媒體網站管理", "管理學", "生產與作業管理", "人力資源管理",
"企業策略管理", "管理文獻探討", "進階專案管理實務", "企業研究方法", "統計學一",
"統計學二", "創新與創業", "職涯分析與規劃", "微積分一", "微積分二", "經濟學")

ib12cn = c("sid", "loam", "創新與創業", "職涯分析與規劃", "微積分一", "微積分二",
"經濟學", "國際商務英文一", "國際商務英文二", "商務英語溝通", "英語口語訓練",
"電子商務概論", "管理經濟學", "電子商務應用", "統計學一", "統計學二", "管理學",
"行銷管理", "國際市場概論", "國際貿易", "國際企業管理", "國貿實務一", "國貿實務二",
"全球行銷管理", "貿易ERP軟體", "會計學一", "會計學二", "財務管理", "國際金融")

ib13cn = c("sid", "loam", "創新與創業", "微積分一", "微積分二", "經濟學", "專案管理實務", "專案企劃實務",
"國際商務英文一", "英語口語訓練", "電子商務概論", "管理經濟學", "電子商務應用",
"統計學一", "統計學二", "管理學", "行銷管理", "國際市場概論", "國際企業管理", "國際貿易與實務一",
"會計學一", "會計學二", "財務管理")

ib14cn = c("sid", "loam", "微積分一", "微積分二", "經濟學", "專案管理實務", "英語口語訓練",
"電子商務概論", "管理經濟學", "統計學一", "管理學", "行銷管理", "國際市場概論",
"會計學一", "會計學二")

ib15cn = c("sid", "loam", "微積分一", "經濟學", "興趣與職涯探索", "行銷管理", "會計學一")

id08cn = c("sid", "loam", "計算機概論", "管理學", "電子商務概論", "企業倫理",
"人因工程", "品質管理", "經濟學", "工作研究", "統計學一", "商業自動化", "微積分二",
"程式語言", "作業研究一", "統計學二", "作業研究二", "物流管理", "微積分一",
"生產與作業管理", "企業資源規劃", "會計學", "工業管理導論", "企業成本分析", 
"設施規劃", "專案管理")

id09cn = c("sid", "loam", "專案管理", "創新與創業", "人因工程", "品質管理", "電子商務概論",
"經濟學", "工作研究", "統計學一", "商業自動化", "微積分二", "程式語言", "作業研究一",
"統計學二", "作業研究二", "物流管理", "微積分一", "生產與作業管理", "企業資源規劃",
"會計學", "工業管理導論", "企業成本分析", "設施規劃", "計算機概論", "管理學")

id10cn = c("sid", "loam", "專案管理", "創新與創業", "微積分一", "微積分二",
"統計學一", "統計學二", "經濟學", "人因工程", "品質管理", "電子商務概論",
"工作研究", "程式語言", "作業研究一", "作業研究二", "物流管理", "生產與作業管理",
"企業資源規劃", "會計學", "工業管理導論", "設施規劃", "計算機概論", "管理學")

id11cn = c("sid", "loam", "創新與創業", "職涯分析與規劃", "微積分一", "微積分二",
"經濟學", "品質管理", "作業研究", "物流管理", "生產與作業管理", "企業資源規劃",
"會計學", "工業管理導論", "設施規劃", "管理學", "計算機應用", "電子商務應用",
"工作研究", "人因工程", "進階專案管理實務", "統計學一", "統計學二")

id12cn = c("sid", "loam", "創新與創業", "職涯分析與規劃", "微積分一", "微積分二",
"經濟學", "品質管理", "作業研究", "物流管理", "生產與作業管理", "企業資源規劃",
"會計學", "工業管理導論", "管理學", "計算機應用", "電子商務應用", "工作研究",
"人因工程", "進階專案管理實務", "統計學一", "統計學二")

id13cn = c("sid", "loam", "創新與創業", "微積分一", "微積分二", "經濟學",
"專案管理實務", "專案企劃實務", "作業研究", "物流管理", "生產與作業管理",
"會計學", "工業管理導論", "管理學", "計算機應用", "電子商務應用", "工作研究",
"人因工程", "統計學一", "統計學二", "品質管理")

id14cn = c("sid", "loam", "微積分一", "微積分二", "經濟學", "專案管理實務",
"作業研究", "生產與作業管理", "會計學", "工業管理導論", "管理學", "計算機應用",
"電子商務應用", "工作研究", "統計學一")

id15cn = c("sid", "loam", "微積分一", "經濟學", "興趣與職涯探索",
"會計學", "工業管理導論", "計算機應用")

im08cn = c("sid", "loam", "計算機概論", "管理學", "電子商務概論", "企業倫理",
"機率論", "統計學", "微積分一", "微積分二", "經濟學", "會計學", "系統分析與設計",
"管理資訊系統", "程式設計", "資料結構", "作業系統", "物件導向程式設計", "程式設計實習",
"進階程式設計", "多媒體概論", "網路規劃與管理", "網路概論", "網際網路程式設計",
"資料庫系統概論", "資料庫管理系統", "書報討論")

im09cn = c("sid", "loam", "專案管理", "創新與創業", "統計學", "微積分一", "微積分二",
"經濟學", "會計學", "管理學", "系統分析與設計", "管理資訊系統", "生產與作業管理", "計算機概論",
"程式設計", "資料結構", "作業系統", "物件導向程式設計", "程式設計實習", "進階程式設計",
"網路規劃與管理", "網路概論", "網際網路程式設計", "資料庫系統概論", "資料庫管理系統")

im10cn = c("sid", "loam", "專案管理", "創新與創業", "微積分一", "微積分二", "統計學一",
"經濟學", "會計學", "管理學", "系統分析與設計", "管理資訊系統", "生產與作業管理", "計算機概論",
"程式設計", "資料結構", "物件導向程式設計", "程式設計實習", "進階程式設計", "網路規劃與管理",
"網路概論", "網際網路程式設計", "延伸標記語言網頁設計", "資料庫系統概論", "資料庫管理系統")

im11cn = c("sid", "loam", "創新與創業", "職涯分析與規劃", "微積分一", "微積分二",
"經濟學", "統計學", "管理學", "系統分析與設計", "管理資訊系統", "生產與作業管理",
"計算機概論", "程式設計", "資料結構", "物件導向程式設計", "程式設計實習", "網路規劃與管理",
"網路概論", "網際網路程式設計", "延伸標記語言網頁設計", "資料庫系統概論", "資料庫管理系統")

im12cn = c("sid", "loam", "創新與創業", "職涯分析與規劃", "微積分一", "微積分二",
"經濟學", "統計學", "管理學", "系統分析與設計", "管理資訊系統", "生產與作業管理",
"計算機概論", "程式設計", "資料結構", "物件導向程式設計", "程式設計實習", "網路規劃與管理",
"網路概論", "網際網路程式設計", "延伸標記語言網頁設計", "資料庫系統概論", "資料庫管理系統")

im13cn = c("sid", "loam", "創新與創業", "微積分一", "微積分二", "經濟學", "專案管理實務",
"專案企劃實務", "統計學", "管理學", "系統分析與設計", "管理資訊系統", "計算機概論", "程式設計",
"資料結構", "物件導向程式設計", "程式設計實習", "網路規劃與管理", "網路概論", "延伸標記語言網頁設計",
"網際網路程式設計", "資料庫系統概論", "資料庫管理系統")

im14cn = c("sid", "loam", "微積分一", "微積分二", "經濟學", "專案管理實務", "統計學",
"管理學", "計算機概論", "程式設計", "資料結構", "物件導向程式設計", "程式設計實習",
"網路規劃與管理", "網路概論")

im15cn = c("sid", "loam", "微積分一", "經濟學", "興趣與職涯探索", "計算機概論", "程式設計", "程式設計實習")

fi08cn = c("sid", "loam", "計算機概論", "管理學", "電子商務概論", "企業倫理", "微積分一",
"微積分二", "統計學一", "統計學二", "經濟學一", "經濟學二", "個體經濟學", "總體經濟學",
"貨幣銀行學一", "貨幣銀行學二", "中級會計學一", "中級會計學二", "網際網路應用",
"電子商務實務", "民法概要", "商事法一", "商事法二", "財務管理一", "財務管理二", "投資學",
"保險學", "保險實務", "投資組合管理", "財金專業證照")

fi09cn = c("sid", "loam", "專案管理", "創新與創業", "微積分一", "微積分二", "統計學一", "統計學二",
"經濟學一", "經濟學二", "個體經濟學", "總體經濟學", "貨幣銀行學一", "貨幣銀行學二",
"中級會計學一", "中級會計學二", "民法概要", "商事法一", "商事法二", "財務管理一", "財務管理二",
"投資學", "保險學", "保險實務", "投資組合管理")

fi10cn = c("sid", "loam", "專案管理", "創新與創業", "微積分一", "微積分二", "統計學一",
"統計學二", "經濟學", "個體經濟學", "總體經濟學", "應用經濟學", "貨幣銀行學一", "貨幣銀行學二",
"中級會計學一", "中級會計學二", "民法概要", "商事法一", "商事法二", "財務管理一", "財務管理二",
"投資學", "保險學", "保險實務", "投資組合管理")

fi11cn = c("sid", "loam", "創新與創業", "職涯分析與規劃", "微積分一", "微積分二",
"經濟學", "統計學一", "統計學二", "應用經濟學", "貨幣銀行學一", "貨幣銀行學二",
"中級會計學一", "中級會計學二", "財務報表分析", "民法概要", "商事法", "財務管理一",
"財務管理二", "投資學", "保險學", "期貨與選擇權", "金融業行銷")

fi12cn = c("sid", "loam", "創新與創業", "職涯分析與規劃", "微積分一", "微積分二",
"經濟學", "統計學一", "統計學二", "應用經濟學", "貨幣銀行學一", "貨幣銀行學二", "中級會計學一",
"中級會計學二", "財務報表分析", "民法概要", "商事法", "財務管理一", "財務管理二", "投資學",
"保險學", "期貨與選擇權", "金融業行銷")

fi13cn = c("sid", "loam", "創新與創業", "微積分一", "微積分二", "經濟學",
"專案管理實務", "專案企劃實務", "統計學一", "統計學二", "應用經濟學", "貨幣銀行學一",
"貨幣銀行學二", "中級會計學一", "中級會計學二", "民法概要", "商事法", "財務管理一",
"財務管理二", "投資學", "保險學", "金融業行銷")

fi14cn = c("sid", "loam", "微積分一", "經濟學", "專案管理實務", "統計學一", "應用經濟學",
"貨幣銀行學一", "中級會計學一", "中級會計學二", "民法概要", "商事法", "財務管理一")

fi15cn = c("sid", "loam", "微積分一", "經濟學", "興趣與職涯探索", "中級會計學一", "民法概要")

